# Creating a Database

In [30]:
import mysql.connector as mydb 
cnx = mydb.connect(
    host = "localhost",
    user = "root",
    password = ""
)
cursor = cnx.cursor()
cursor.execute("CREATE DATABASE university")

# Check if Database Exists

In [31]:
cursor.execute("SHOW DATABASES")
for x in cursor:
  print(x)

('information_schema',)
('mysql',)
('performance_schema',)
('phpmyadmin',)
('test',)
('university',)

# connecting to the database

In [32]:
import mysql.connector as mydb
cnx = mydb.connect(host = "localhost", user = "root", password = "", database = "university")
cursor = cnx.cursor()
cursor.execute('CREATE TABLE students (id INT AUTO_INCREMENT PRIMARY KEY, rollno INT, name VARCHAR(20), division VARCHAR(5))')

# Alter DataBase

In [33]:
# ALter table column
cursor.execute('ALTER TABLE students ADD COLUMN age INT')

# Insert Into Table

In [34]:
import mysql.connector as mydb
cnx = mydb.connect(host = "localhost", user = "root", password = "", database = "university")
cursor = cnx.cursor()

sql = "INSERT INTO students (id, name, rollno, division, age) VALUES (1, 'Hemant', 30, 'B', 21)"

cursor.execute(sql)
cnx.commit()
print(cursor.rowcount, 'record inserted.')

1 record inserted.

In [35]:
#insert many rows
import mysql.connector as mydb
cnx = mydb.connect(host = "localhost", user = "root", password = "", database = "university")
cursor = cnx.cursor()

sql = "INSERT INTO students (name, rollno, division, age) VALUES (%s, %s, %s, %s)"
val = [
    ('vijay', '90', 'B', '21'),
    ('aniket', '29', 'B', '22'),
    ('hitesh', '28', 'B', '20'),
    ('rohit', '19', 'B', '21'),
    ('manu', '24', 'B', '22'),
    ('apurva', '25', 'B', '22'),
    ('swara', '21', 'B', '23'),
    ('sanjeeb', '18', 'B', '22'),  
]
cursor.executemany(sql, val)
cnx.commit()
print(cursor.rowcount, 'was inserted')

8 was inserted

In [37]:
# return the Last Row ID 
import mysql.connector as mydb
cnx = mydb.connect(host = "localhost", user = "root", password = "", database = "university")
cursor = cnx.cursor()

sql = "INSERT INTO students (name, rollno, division, age) VALUES (%s, %s, %s, %s)"
val = ('sanjana', '12', 'A', '23')
cursor.execute(sql, val)
cnx.commit()

print("1 record inserted, ID:", cursor.lastrowid)

1 record inserted, ID: 10

# Select From OR fetch data

In [39]:
import mysql.connector as mydb
cnx = mydb.connect(host = 'localhost', user = 'root', password = '', database = 'university')
cursor = cnx.cursor()

cursor.execute('SELECT * FROM students')
result = cursor.fetchall()

for x in result:
    print(x)

(1, 30, 'Hemant', 'B', 21)
(2, 90, 'vijay', 'B', 21)
(3, 29, 'aniket', 'B', 22)
(4, 28, 'hitesh', 'B', 20)
(5, 19, 'rohit', 'B', 21)
(6, 24, 'manu', 'B', 22)
(7, 25, 'apurva', 'B', 22)
(8, 21, 'swara', 'B', 23)
(9, 18, 'sanjeeb', 'B', 22)
(10, 12, 'sanjana', 'A', 23)

In [42]:
# fetch specific column
cursor.execute("SELECT students.name, students.age FROM students")
result = cursor.fetchall()
for x in result:
    print(x)

('Hemant', 21)
('vijay', 21)
('aniket', 22)
('hitesh', 20)
('rohit', 21)
('manu', 22)
('apurva', 22)
('swara', 23)
('sanjeeb', 22)
('sanjana', 23)

In [43]:
import mysql.connector as mydb
cnx = mydb.connect(host = 'localhost', user = 'root', password = '', database = 'university')
cursor = cnx.cursor()

cursor.execute('SELECT * FROM students')
result = cursor.fetchone()
print(result)

(1, 30, 'Hemant', 'B', 21)

# Where

In [57]:
import mysql.connector as mydb
cnx = mydb.connect(host = 'localhost', user = 'root', password = '', database = 'university')
cursor = cnx.cursor()

sql = "SELECT * FROM students WHERE id <= '6'"
cursor.execute(sql)
result = cursor.fetchall()

for x in result:
    print(x)

(1, 30, 'Hemant', 'B', 21)
(2, 90, 'vijay', 'B', 21)
(3, 29, 'aniket', 'B', 22)
(4, 28, 'hitesh', 'B', 20)
(5, 19, 'rohit', 'B', 21)
(6, 24, 'manu', 'B', 22)

In [61]:
# fetch user Choice Values
import mysql.connector as mydb
cnx = mydb.connect(host = 'localhost', user = 'root', password = '', database = 'university')
cursor = cnx.cursor()

sql = "SELECT * FROM students WHERE name = %s"
val = input('Enter name: ')
lst = list()
lst.append(val)
cursor.execute(sql, lst)
result = cursor.fetchall()

for x in result:
    print(x)

Enter name: vijay
(2, 90, 'vijay', 'B', 21)

# Order By

In [62]:
import mysql.connector as mydb
cnx = mydb.connect(host = 'localhost', user = 'root', password = '', database = 'university')
cursor = cnx.cursor()

sql = "SELEct * FROM students ORDER BY name"
cursor.execute(sql)
result = cursor.fetchall()

for x in result:
    print(x)

(3, 29, 'aniket', 'B', 22)
(7, 25, 'apurva', 'B', 22)
(1, 30, 'Hemant', 'B', 21)
(4, 28, 'hitesh', 'B', 20)
(6, 24, 'manu', 'B', 22)
(5, 19, 'rohit', 'B', 21)
(10, 12, 'sanjana', 'A', 23)
(9, 18, 'sanjeeb', 'B', 22)
(8, 21, 'swara', 'B', 23)
(2, 90, 'vijay', 'B', 21)

In [64]:
sql = "SELECT * FROM students ORDER BY name DESC"
cursor.execute(sql)
result = cursor.fetchall()

for x in result:
    print(x)

(2, 90, 'vijay', 'B', 21)
(8, 21, 'swara', 'B', 23)
(9, 18, 'sanjeeb', 'B', 22)
(10, 12, 'sanjana', 'A', 23)
(5, 19, 'rohit', 'B', 21)
(6, 24, 'manu', 'B', 22)
(4, 28, 'hitesh', 'B', 20)
(1, 30, 'Hemant', 'B', 21)
(7, 25, 'apurva', 'B', 22)
(3, 29, 'aniket', 'B', 22)

# Delete From By

In [72]:
import mysql.connector as mydb
cnx = mydb.connect(host = 'localhost', user = 'root', password = '', database = 'university')
cursor = cnx.cursor()

sql = "DELETE FROM students WHERE name = 'swara'"
cursor.execute(sql)
cnx.commit()
sql = "SELECT * FROM students"
cursor.execute(sql)
result = cursor.fetchall()

for x in result:
    print(x)

(1, 30, 'Hemant', 'B', 21)
(2, 90, 'vijay', 'B', 21)
(3, 29, 'aniket', 'B', 22)
(4, 28, 'hitesh', 'B', 20)
(5, 19, 'rohit', 'B', 21)
(6, 24, 'manu', 'B', 22)
(7, 25, 'apurva', 'B', 22)
(9, 18, 'sanjeeb', 'B', 22)
(10, 12, 'sanjana', 'A', 23)

In [73]:
sql = "DELETE FROM students WHERE name = %s"
lst = list()
var = input("enter name: ")
lst.append(var)
cursor.execute(sql, lst)
cnx.commit()
sql = "SELECT * FROM students"
cursor.execute(sql)
result = cursor.fetchall()

for x in result:
    print(x)

enter name: apurva
(1, 30, 'Hemant', 'B', 21)
(2, 90, 'vijay', 'B', 21)
(3, 29, 'aniket', 'B', 22)
(4, 28, 'hitesh', 'B', 20)
(5, 19, 'rohit', 'B', 21)
(6, 24, 'manu', 'B', 22)
(9, 18, 'sanjeeb', 'B', 22)
(10, 12, 'sanjana', 'A', 23)

# Copy Table all contain into another Table

In [75]:
import mysql.connector as mydb
cnx = mydb.connect(host = 'localhost', user = 'root', password = '', database = 'university')
cursor = cnx.cursor()

query = "CREATE TABLE copy_students SELECT * FROM students"
cursor.execute(query)

query = "SELECT * FROM copy_students"
cursor.execute(query)

result = cursor.fetchall()

for x in result:
    print(x)

(1, 30, 'Hemant', 'B', 21)
(2, 90, 'vijay', 'B', 21)
(3, 29, 'aniket', 'B', 22)
(4, 28, 'hitesh', 'B', 20)
(5, 19, 'rohit', 'B', 21)
(6, 24, 'manu', 'B', 22)
(9, 18, 'sanjeeb', 'B', 22)
(10, 12, 'sanjana', 'A', 23)

# Drop Table

In [76]:
import mysql.connector as mydb
cnx = mydb.connect(host = 'localhost', user = 'root', password = '', database = 'university')
cursor = cnx.cursor()

sql = "DROP TABLE copy_students"
cursor.execute(sql)

# Update Table

In [83]:
import mysql.connector as mydb
cnx = mydb.connect(host = 'localhost', user = 'root', password = '', database = 'university')
cursor = cnx.cursor()

sql = "UPDATE students SET age = '29' WHERE name = 'Hemant'"
cursor.execute(sql)
cnx.commit()

sql = "SELECT * FROM students"
cursor.execute(sql)

result = cursor.fetchall()
for x in result:
    print(x)

(1, 30, 'Hemant', 'B', 29)
(2, 90, 'vijay', 'B', 21)
(3, 29, 'aniket', 'B', 22)
(4, 28, 'hitesh', 'B', 20)
(5, 19, 'rohit', 'B', 21)
(6, 24, 'manu', 'B', 22)
(9, 18, 'sanjeeb', 'B', 22)
(10, 12, 'sanjana', 'A', 23)